Revit 2027 API
DeleteElements.Create(Document, ElementId) Method
 Creates an instance of the DeleteElements resolution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureResolution Create(
	Document document,
	ElementId id
)
Public Shared Function Create (
	document As Document,
	id As ElementId
) As FailureResolution
public:
static FailureResolution^ Create(
	Document^ document,
	ElementId^ id
)
static member Create :
        document : Document *
        id : ElementId -> FailureResolution
Parameters
document Document
 The document which owns the element to delete.
id ElementId
 The id of the element that will be deleted when this resolution is chosen.
Return Value
FailureResolution
 The instance of the DeletedElements resolution.
Exceptions
Exception | Condition
ArgumentException |  The input id is not valid for deletion.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DeleteElements Class
Create Overload
Autodesk.Revit.DB Namespace